# Dataframes

In [1]:
import pandas as pd

ages = pd.Series([20, 30, 25, 60, 27], index = ['Juan', 'Mary', 'Peter', 'Ana', 'Alex'])
ages

Juan     20
Mary     30
Peter    25
Ana      60
Alex     27
dtype: int64

In [2]:
ages2 = pd.Series([21, 31, 26, 61, 28], index = ['Juan', 'Mary', 'Peter', 'Ana', 'Alex'])
ages2

Juan     21
Mary     31
Peter    26
Ana      61
Alex     28
dtype: int64

In [3]:
d_ages = pd.DataFrame({'Ages': ages})
d_ages

       Ages
Juan     20
Mary     30
Peter    25
Ana      60
Alex     27

In [4]:
d_ages = pd.DataFrame({'Ages': ages, 'Ages_1': ages2})
d_ages

       Ages  Ages_1
Juan     20      21
Mary     30      31
Peter    25      26
Ana      60      61
Alex     27      28

In [5]:
d_ages.Ages

Juan     20
Mary     30
Peter    25
Ana      60
Alex     27
Name: Ages, dtype: int64

## Dataframes example 2

In [6]:
# importing pandas
dataFrame = pd.DataFrame([[2,4,6],[10,20,30]], columns=["col1", "col2", "col3"], index=["row1","row2"])
print(dataFrame)

      col1  col2  col3
row1     2     4     6
row2    10    20    30

In [7]:
# Selecting column 1
print(dataFrame.col1)

# Calculating mean
print(dataFrame.col1.mean())

row1     2
row2    10
Name: col1, dtype: int64
6.0

In [8]:
# Using Dictionaries as dataframes
datos = {'col_1': [3, 2, 1, 0], 'col_2': ['a', 'b', 'c', 'd']}
df2 = pd.DataFrame.from_dict(datos)
print(df2)

   col_1 col_2
0      3     a
1      2     b
2      1     c
3      0     d

In [9]:
# Printing shape parameters
size = df2.shape
rows = size[0]
cols = size[1]

print(size)
print(rows)
print(cols)

(4, 2)
4
2

In [10]:
# 
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(5, 4),['row1', 'row2', 'row3', 'row4', 'row5'], ['col1', 'col2', 'col3', 'col4'])
df

          col1      col2      col3      col4
row1  0.017905  0.608906 -0.793924  1.320116
row2 -0.312825  0.293341 -0.618643  0.543260
row3 -1.159187  2.209479  1.311221  0.584840
row4  0.305691 -0.786164  0.561041 -1.623479
row5 -0.229083 -0.606890 -1.644790  0.104287

In [11]:
# Selecting a specific value
df.at['row1', 'col1']

0.017905055051762715

In [12]:
# Selecting a specific value
df.iat[0, 0]

0.017905055051762715

In [13]:
# Selecting column
df['col1'] # df.col1

row1    0.017905
row2   -0.312825
row3   -1.159187
row4    0.305691
row5   -0.229083
Name: col1, dtype: float64

In [14]:
# Selecting two columns
df[['col1', 'col2']]

          col1      col2
row1  0.017905  0.608906
row2 -0.312825  0.293341
row3 -1.159187  2.209479
row4  0.305691 -0.786164
row5 -0.229083 -0.606890

In [15]:
# Generating new column
df['other'] = df['col3'] + df['col4']
df

          col1      col2      col3      col4     other
row1  0.017905  0.608906 -0.793924  1.320116  0.526192
row2 -0.312825  0.293341 -0.618643  0.543260 -0.075383
row3 -1.159187  2.209479  1.311221  0.584840  1.896061
row4  0.305691 -0.786164  0.561041 -1.623479 -1.062438
row5 -0.229083 -0.606890 -1.644790  0.104287 -1.540503

In [16]:
# Dropping columns
# Inplace is for save data
df.drop('other', axis = 1, inplace = True)
df

          col1      col2      col3      col4
row1  0.017905  0.608906 -0.793924  1.320116
row2 -0.312825  0.293341 -0.618643  0.543260
row3 -1.159187  2.209479  1.311221  0.584840
row4  0.305691 -0.786164  0.561041 -1.623479
row5 -0.229083 -0.606890 -1.644790  0.104287

In [17]:
# Dropping Rows
df.drop('row1')

          col1      col2      col3      col4
row2 -0.312825  0.293341 -0.618643  0.543260
row3 -1.159187  2.209479  1.311221  0.584840
row4  0.305691 -0.786164  0.561041 -1.623479
row5 -0.229083 -0.606890 -1.644790  0.104287

In [18]:
# row was not deleted
# it needs inplace parameter in True
df

          col1      col2      col3      col4
row1  0.017905  0.608906 -0.793924  1.320116
row2 -0.312825  0.293341 -0.618643  0.543260
row3 -1.159187  2.209479  1.311221  0.584840
row4  0.305691 -0.786164  0.561041 -1.623479
row5 -0.229083 -0.606890 -1.644790  0.104287

In [19]:
# Using loc method for named index
df.loc['row1']

col1    0.017905
col2    0.608906
col3   -0.793924
col4    1.320116
Name: row1, dtype: float64

In [20]:
# using iloc for numeric index
df.iloc[0]

col1    0.017905
col2    0.608906
col3   -0.793924
col4    1.320116
Name: row1, dtype: float64

In [21]:
# Selecting specific values
df.loc['row1', 'col2']

0.6089062445602824

In [22]:
#Selecting several values
df.loc[['row1', 'row2'],['col1', 'col3']]

          col1      col3
row1  0.017905 -0.793924
row2 -0.312825 -0.618643

In [23]:
# Conditional selecting
df[df['col1'] > 0]

          col1      col2      col3      col4
row1  0.017905  0.608906 -0.793924  1.320116
row4  0.305691 -0.786164  0.561041 -1.623479

In [24]:
# Another way
df[df.col1 > 0]

          col1      col2      col3      col4
row1  0.017905  0.608906 -0.793924  1.320116
row4  0.305691 -0.786164  0.561041 -1.623479

In [25]:
# Selecting from conditionals
df[df['col1'] > 0][['col2', 'col4']]

          col2      col4
row1  0.608906  1.320116
row4 -0.786164 -1.623479

In [26]:
# Another way
df[df.col1 > 0][['col2', 'col4']]

          col2      col4
row1  0.608906  1.320116
row4 -0.786164 -1.623479

In [27]:
# Multiple conditions
# & is for "and" in columns. | is for "or"
df[(df['col1'] < 0) & (df['col3'] < 0)]

          col1      col2      col3      col4
row2 -0.312825  0.293341 -0.618643  0.543260
row5 -0.229083 -0.606890 -1.644790  0.104287

In [28]:
# Multiple levels for index
out_ = ['O1', 'O1', 'O1', 'O2', 'O2', 'O2']
in_ = [1, 2, 3, 1, 2, 3]
h_index = list(zip(out_, in_))
h_index = pd.MultiIndex.from_tuples(h_index)

In [29]:
import numpy as np
import pandas as pn

df_m = pn.DataFrame(np.random.rand(6,5), h_index, ['col1', 'col2', 'col3', 'col4', 'col5'])
df_m

          col1      col2      col3      col4      col5
O1 1  0.904684  0.283572  0.348189  0.687524  0.006447
   2  0.006225  0.202608  0.353658  0.716551  0.486374
   3  0.686102  0.425595  0.046244  0.325893  0.042799
O2 1  0.227784  0.976252  0.788436  0.637304  0.142902
   2  0.271546  0.657183  0.250518  0.288570  0.172508
   3  0.630700  0.389675  0.012203  0.984493  0.310598

In [30]:
# Adding names to indexes
df_m.index.names = ['Groups','Nums']
df_m

                 col1      col2      col3      col4      col5
Groups Nums
O1     1     0.904684  0.283572  0.348189  0.687524  0.006447
       2     0.006225  0.202608  0.353658  0.716551  0.486374
       3     0.686102  0.425595  0.046244  0.325893  0.042799
O2     1     0.227784  0.976252  0.788436  0.637304  0.142902
       2     0.271546  0.657183  0.250518  0.288570  0.172508
       3     0.630700  0.389675  0.012203  0.984493  0.310598

In [31]:
# Selecting a sub dataframe
df_m.loc['O1']

          col1      col2      col3      col4      col5
Nums
1     0.904684  0.283572  0.348189  0.687524  0.006447
2     0.006225  0.202608  0.353658  0.716551  0.486374
3     0.686102  0.425595  0.046244  0.325893  0.042799

In [32]:
# Using missing values
d = {'A':[10, np.nan], 'B':[np.nan, 50] }
df_d = pn.DataFrame(d)
df_d

      A     B
0  10.0   NaN
1   NaN  50.0

In [33]:
df_d.dropna()

Empty DataFrame
Columns: [A, B]
Index: []

In [34]:
df_d.fillna('filled')

        A       B
0      10  filled
1  filled      50

## Modifying Dataframes

In [35]:
score1 = pd.Series([200, 300, 250, 600, 270], index = ['Juan', 'Mary', 'Peter', 'Ana', 'Alex'])
score2 = pd.Series([230, 320, 280, 570, 370], index = ['Juan', 'Mary', 'Peter', 'Ana', 'Alex'])
score3 = pd.Series([130, 370, 480, 370, 490], index = ['Juan', 'Mary', 'Peter', 'Ana', 'Alex'])

d_scores = pd.DataFrame({'Score1': score1, 'Score2': score1, 'Score3': score1})
d_scores

       Score1  Score2  Score3
Juan      200     200     200
Mary      300     300     300
Peter     250     250     250
Ana       600     600     600
Alex      270     270     270

In [36]:
# Changing column names
d_scores_n = d_scores.rename(columns = {'Score1': 'First_Year'})
d_scores_n

       First_Year  Score2  Score3
Juan          200     200     200
Mary          300     300     300
Peter         250     250     250
Ana           600     600     600
Alex          270     270     270

In [37]:
# Adding new column
d_scores_n['Score4'] = ([400, 340, 560, 450, 540]) 
d_scores_n

       First_Year  Score2  Score3  Score4
Juan          200     200     200     400
Mary          300     300     300     340
Peter         250     250     250     560
Ana           600     600     600     450
Alex          270     270     270     540

In [38]:
# Adding a new Row
d_scores_n.loc['Stuart'] = ([340, 260, 480, 340]) 
d_scores_n

        First_Year  Score2  Score3  Score4
Juan           200     200     200     400
Mary           300     300     300     340
Peter          250     250     250     560
Ana            600     600     600     450
Alex           270     270     270     540
Stuart         340     260     480     340

In [39]:
# Changing a value
d_scores_n.loc['Stuart', 'First_Year'] = 300
d_scores_n

        First_Year  Score2  Score3  Score4
Juan           200     200     200     400
Mary           300     300     300     340
Peter          250     250     250     560
Ana            600     600     600     450
Alex           270     270     270     540
Stuart         300     260     480     340

In [40]:
# Using insert method
d_scores_n.insert(1, 'Score1', [100, 200, 300, 200, 150, 240])
d_scores_n

        First_Year  Score1  Score2  Score3  Score4
Juan           200     100     200     200     400
Mary           300     200     300     300     340
Peter          250     300     250     250     560
Ana            600     200     600     600     450
Alex           270     150     270     270     540
Stuart         300     240     260     480     340

In [41]:
# Changing column names
d_scores_n.columns = ['First', 'Second', 'Third', 'Fourth', 'Fifth']
d_scores_n

        First  Second  Third  Fourth  Fifth
Juan      200     100    200     200    400
Mary      300     200    300     300    340
Peter     250     300    250     250    560
Ana       600     200    600     600    450
Alex      270     150    270     270    540
Stuart    300     240    260     480    340

In [42]:
# Creating a new dataframe
First = pd.Series([200, 300], index = ['Fred', 'Dany'])
Second = pd.Series([230, 320], index = ['Fred', 'Dany'])
Third = pd.Series([300, 400], index = ['Fred', 'Dany'])
Fourth = pd.Series([430, 420], index = ['Fred', 'Dany'])
Fifth = pd.Series([500, 600], index = ['Fred', 'Dany'])

new_scores = pd.DataFrame({'First': First, 'Second': Second, 'Third': Third, 'Fourth': Fourth, 'Fifth': Fifth})
new_scores

      Fifth  First  Fourth  Second  Third
Fred    500    200     430     230    300
Dany    600    300     420     320    400

In [43]:
# Appending Dataframes
total = d_scores_n.append(new_scores)
total

        Fifth  First  Fourth  Second  Third
Juan      400    200     200     100    200
Mary      340    300     300     200    300
Peter     560    250     250     300    250
Ana       450    600     600     200    600
Alex      540    270     270     150    270
Stuart    340    300     480     240    260
Fred      500    200     430     230    300
Dany      600    300     420     320    400